function i=problem11(pumpt)   %在进出油的同时影响高压油管压力，而高压油管压力又反作用于进出油的速率。因此通过该程序测试单向阀不同开启时长pumpt以维持100MPa压力的稳定，并绘制高压油管压力随时间变化的图像

phigh=160;                  %高压油泵压力phigh
rohigh=roF(160);            %高压油泵（高压侧燃油）密度rohigh
V=pi*500*5*5;               %高压油管体积V
C=0.85;                     %流量系数C
A=pi*0.7*0.7;               %供油入口A处小孔面积A
t=zeros(10000000,1);        %正常时间t(i)，单位ms
t1=zeros(10000000,1);       %用来判断是否为出油时间的t1(i)
t2=zeros(10000000,1);       %用来判断是否为进油时间的t2(i)
p=zeros(10000000,1);        %高压油管内的油量压力p(i)
p(1)=100;                   %初始化高压油管内的初始油量压力
ro=zeros(10000000,1);       %高压油管内的油量密度ro(i)
ro(1)=0.85;                 %初始化高压油管内的初始油量密度
m=zeros(10000000,1);        %高压油管内的油量质量m(i)
pumpin=zeros(10000000,1);   %在时间i高压油管内的进油质量pumpin(i)
pumpout=zeros(10000000,1);  %在时间i高压油管内的出油质量pumpout(i)
m(1)=ro(1)*V;               %初始化高压油管内的初始油量质量

for i=1:10000000     %将整个时间段划分为10000000个区间，每个区间为0.01ms，利用数值积分方法计算结果，每个出油周期为100ms，即10000次循环为一出油周期
    t(i)=i/100;                      %换算使t(i)单位为ms
    t1(i)=rem(i,100*100)/100;        %计算当前时间在当前周期的时间（周期开始为0时间）
    t2(i)=rem(i,100*100)/100;       
    if t2(i)<=pumpt      %判断当前时间在当前周期内是否为进油时间
        pumpin(i)=0.01*(C*A*sqrt(2*(phigh-p(i))/rohigh))*rohigh;    %如果当前时间为进油时间则用流量公式计算进油质量
    end
    if t1(i)<=0.2       %判断当前时间在当前周期内是否为出油时间，并根据题目所给出油速率函数图像计算出油质量
        pumpout(i)=0.01*100*t1(i)*ro(i);
    end
    if t1(i)>0.2&&t1(i)<=2.2
        pumpout(i)=0.01*20*ro(i);
    end
    if t1(i)>2.2&&t1(i)<2.4
        pumpout(i)=0.01*100*(2.4-t1(i))*ro(i);
    end
    m(i+1)=m(i)+pumpin(i)-pumpout(i);   %递推下一时间i高压油管内的油量质量、高压油管内的油量密度及高压油管内的压力
    ro(i+1)=m(i+1)/V;
    p(i+1)=Fro(ro(i+1));
end

t(i+1)=t(i)+0.01;   %使矩阵t维度加一以符合矩阵p的维度
scatter(t,p,1);     %绘制高压油管内压力随时间变化的图像
%disp(i/100);
title('考虑在进出油时压力微弱变化影响下压力随时间的变化');
xlabel('时间/ms');
ylabel('压力/MPa');
    